[Rainmeter]
update = -1
accurateText = 0
dynamicWindowSize = 0
group = ToggleByAssistBtn

[Metadata]
name = Rhodes_Island_UI
author = 热心炎国云玩家
information = 让您在PC上也能享受到罗德岛终端系统的交互界面。|角落图标按钮。
license = Closure Commons 署名-不许获利-传递下去 42.0
version = 0.6

[Variables]
@Include1 = #@#Global.ini


;暗角
[mtBtnCornerVtg]
meter = Image
imageName = #@#Images\CornerVintage.png
x = 0
y = 0
h = 130

;按钮 "她摁下按钮后会发生很多事情，但其中绝对不包括爆炸。"
[mtBtnCorner1]
meter = Image
imageName = #BtnCorner1Icon#
x = 12
y = (12+#BtnCornerIconOffsetY#)
h = 76
leftMouseDownAction = [Play #BtnSound#]
leftMouseUpAction = #BtnCorner1Action#

[mtBtnCorner2]
meter = Image
imageName = #BtnCorner2Icon#
x = 0R
y = 0r
h = 76
leftMouseDownAction = [Play #BtnSound#]
leftMouseUpAction = #BtnCorner2Action#

[mtBtnCorner3]
meter = Image
imageName = #BtnCorner3Icon#
x = 0R
y = 0r
h = 76
leftMouseDownAction = [Play #BtnSound#]
leftMouseUpAction = #BtnCorner3Action#

[mtBtnCorner4]
meter = Image
imageName = #BtnCorner4Icon#
x = 0R
y = 0r
h = 76
leftMouseDownAction = [Play #BtnSound#]
leftMouseUpAction = #BtnCorner4Action#